package my.les.on.vw;

public class Task01 {

	public static void main(String[] args) {
		// Написать приведенную формулу по правилам языка программирования.

		double x = 0.5;
		double y;

		y = Math.sqrt(Math.pow(Math.E, 2.2 * x)) - Math.abs(Math.sin((Math.PI * x) / (x + 2.0 / 3.0))) + 1.7;

		System.out.println("y = " + y);

	}

}
